; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v7 - type_2 ?v8 - type_1)
 	      (pred_3 ?v6 - object ?v8 - type_1)
	      (pred_4 ?v7 - type_2 ?v2 - type_3)
	      (pred_2 ?v7 - type_2 ?v6 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v7 - type_2 ?v3 ?v1 - type_1)
       :precondition (and  (pred_1 ?v7 ?v3))
       :effect (and  (pred_1 ?v7 ?v1)
		     (not (pred_1 ?v7 ?v3))))

   (:action op_2
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_1 ?v7 ?v4) (pred_4 ?v7 ?v2))
       :effect (and (pred_2 ?v7 ?v5 ?v2)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_4 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v5 - object ?v4 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v5 ?v2) (pred_1 ?v7 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_4 ?v7 ?v2)
		    (not (pred_2 ?v7 ?v5 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_01 - type_2
obj_02 obj_03 obj_07 obj_12 - type_3
obj_08 obj_13 obj_06 obj_11 - type_1
obj_04 obj_09 obj_05 - object)
(:init
(pred_1 obj_10 obj_08)
(pred_4 obj_10 obj_02)
(pred_4 obj_10 obj_03)
(pred_1 obj_01 obj_11)
(pred_4 obj_01 obj_07)
(pred_4 obj_01 obj_12)
(pred_3 obj_04 obj_13)
(pred_3 obj_09 obj_06)
(pred_3 obj_05 obj_11)
)
(:goal
(and
(pred_3 obj_04 obj_06)
(pred_3 obj_09 obj_11)
(pred_3 obj_05 obj_13)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_10 obj_06) (pred_1 obj_01 obj_06))))
    (always (not (and (pred_1 obj_10 obj_11) (pred_1 obj_01 obj_11))))
  )
)
)

; plan
1. (op_2 obj_01 obj_05 obj_11 obj_12)
   deleted: (pred_3 obj_05 obj_11) (pred_4 obj_01 obj_12)
   added: (pred_2 obj_01 obj_05 obj_12)
   goals met: 0 of 3
2. (op_3 obj_10 obj_08 obj_06)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_06)
   goals met: 0 of 3
3. (op_3 obj_01 obj_11 obj_13)
   deleted: (pred_1 obj_01 obj_11)
   added: (pred_1 obj_01 obj_13)
   goals met: 0 of 3
4. (op_2 obj_10 obj_09 obj_06 obj_03)
   deleted: (pred_3 obj_09 obj_06) (pred_4 obj_10 obj_03)
   added: (pred_2 obj_10 obj_09 obj_03)
   goals met: 0 of 3
5. (op_3 obj_10 obj_06 obj_11)
   deleted: (pred_1 obj_10 obj_06)
   added: (pred_1 obj_10 obj_11)
   goals met: 0 of 3
6. (op_1 obj_01 obj_05 obj_13 obj_12)
   deleted: (pred_2 obj_01 obj_05 obj_12)
   added: (pred_3 obj_05 obj_13) (pred_4 obj_01 obj_12)
   goals met: 1 of 3
7. (op_2 obj_01 obj_04 obj_13 obj_07)
   deleted: (pred_3 obj_04 obj_13) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_04 obj_07)
   goals met: 1 of 3
8. (op_3 obj_01 obj_13 obj_06)
   deleted: (pred_1 obj_01 obj_13)
   added: (pred_1 obj_01 obj_06)
   goals met: 1 of 3
9. (op_1 obj_10 obj_09 obj_11 obj_03)
   deleted: (pred_2 obj_10 obj_09 obj_03)
   added: (pred_3 obj_09 obj_11) (pred_4 obj_10 obj_03)
   goals met: 2 of 3
10. (op_1 obj_01 obj_04 obj_06 obj_07)
   deleted: (pred_2 obj_01 obj_04 obj_07)
   added: (pred_3 obj_04 obj_06) (pred_4 obj_01 obj_07)
   goals met: 3 of 3
